cask_args appdir: '/Applications'
#cask "alfred"
cask "google-chrome"
cask "drivedx"
cask "dropbox"
cask "steam"
#cask "iterm2"
cask "evernote"
cask "vlc"

brew "mas" # Mac App Store command-line interface
mas "ForkLift", id:412448059
mas "Skitch", id:425955336
mas "The Unarchiver", id:425424353
mas "EdgeView 2", id:1206246482
mas "1Password 6", id:443987910
mas "AdGuard for Safari", id:1440147259

brew "ctags"
brew "global", args: ["with-exuberant-ctags", "with-pygments"]
brew "emacs"
brew "cask" # Emacs dependency management
brew "byobu"
brew "ack"

brew "erlang"

# Haskell
brew "ghc"
brew "cabal-install" # Command-line interface for Cabal and Hackage
# cabal update

brew "perl"
brew "cpanm"
brew "python@3"
brew "node"
brew "go"
brew "rust"

brew "coreutils" # GNU File, Shell, and Text utilities
#brew "zsh"
brew "bash"
